Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
apply)
+       default_cooldown                 = (known after apply)
+       desired_capacity                 = 1
+       force_delete                     = false
+       force_delete_warm_pool           = false
+       health_check_grace_period        = 300
+       health_check_type                = (known after apply)
+       id                               = (known after apply)
+       ignore_failed_scaling_activities = false
+       load_balancers                   = (known after apply)
+       max_size                         = 1
+       metrics_granularity              = "1Minute"
+       min_size                         = 1
+       name                             = (known after apply)
+       name_prefix                      = "my-2-tier-ec2"
+       predicted_capacity               = (known after apply)
+       protect_from_scale_in            = false
+       service_linked_role_arn          = (known after apply)
+       target_group_arns                = (known after apply)
+       vpc_zone_identifier              = (known after apply)
+       wait_for_capacity_timeout        = "10m"
+       warm_pool_size                   = (known after apply)

+       availability_zone_distribution (known after apply)

+       launch_template (known after apply)

+       mixed_instances_policy {
+           instances_distribution {
+               on_demand_allocation_strategy            = (known after apply)
+               on_demand_base_capacity                  = 0
+               on_demand_percentage_above_base_capacity = 0
+               spot_allocation_strategy                 = (known after apply)
+               spot_instance_pools                      = 0
            }
+           launch_template {
+               launch_template_specification {
+                   launch_template_id   = (known after apply)
+                   launch_template_name = (known after apply)
+                   version              = "$Latest"
                }
+               override {
+                   instance_type = "t3.nano"
                }
+               override {
+                   instance_type = "t3a.nano"
                }
            }
        }

+       tag {
+           key                 = "Name"
+           propagate_at_launch = false
+           value               = "nat-instance-my-2-tier-ec2"
        }
+       tag {
+           key                 = "Terraform"
+           propagate_at_launch = false
+           value               = "true"
        }
+       tag {
+           key                 = "environment"
+           propagate_at_launch = false
+           value               = "dev"
        }

+       traffic_source (known after apply)
    }

  # module.network.module.nat.aws_iam_instance_profile.this will be created
+ resource "aws_iam_instance_profile" "this" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "my-2-tier-ec2"
+       path        = "/"
+       role        = (known after apply)
+       tags        = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all    = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       unique_id   = (known after apply)
    }

  # module.network.module.nat.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "my-2-tier-ec2"
+       path                  = "/"
+       tags                  = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all              = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.network.module.nat.aws_iam_role_policy.eni will be created
+ resource "aws_iam_role_policy" "eni" {
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "my-2-tier-ec2"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:AttachNetworkInterface",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role        = (known after apply)
    }

  # module.network.module.nat.aws_iam_role_policy_attachment.ssm will be created
+ resource "aws_iam_role_policy_attachment" "ssm" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = (known after apply)
    }

  # module.network.module.nat.aws_launch_template.this will be created
+ resource "aws_launch_template" "this" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       description     = "Launch template for NAT instance my-2-tier-ec2"
+       id              = (known after apply)
+       image_id        = "ami-0e4f2a1b8f55a8acd"
+       latest_version  = (known after apply)
+       name            = (known after apply)
+       name_prefix     = "my-2-tier-ec2"
+       tags            = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all        = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       user_data       = (known after apply)
        # (1 unchanged attribute hidden)

+       iam_instance_profile {
+           arn = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = "required"
+           instance_metadata_tags      = (known after apply)
        }

+       network_interfaces {
+           associate_public_ip_address = "true"
+           delete_on_termination       = "true"
+           security_groups             = (known after apply)
        }

+       tag_specifications {
+           resource_type = "instance"
+           tags          = {
+               "Name"        = "nat-instance-my-2-tier-ec2"
+               "Terraform"   = "true"
+               "environment" = "dev"
            }
        }
    }

  # module.network.module.nat.aws_network_interface.this will be created
+ resource "aws_network_interface" "this" {
+       arn                       = (known after apply)
+       description               = "ENI for NAT instance my-2-tier-ec2"
+       enable_primary_ipv6       = (known after apply)
+       id                        = (known after apply)
+       interface_type            = (known after apply)
+       ipv4_prefix_count         = (known after apply)
+       ipv4_prefixes             = (known after apply)
+       ipv6_address_count        = (known after apply)
+       ipv6_address_list         = (known after apply)
+       ipv6_address_list_enabled = false
+       ipv6_addresses            = (known after apply)
+       ipv6_prefix_count         = (known after apply)
+       ipv6_prefixes             = (known after apply)
+       mac_address               = (known after apply)
+       outpost_arn               = (known after apply)
+       owner_id                  = (known after apply)
+       private_dns_name          = (known after apply)
+       private_ip                = (known after apply)
+       private_ip_list           = (known after apply)
+       private_ip_list_enabled   = false
+       private_ips               = (known after apply)
+       private_ips_count         = (known after apply)
+       security_groups           = (known after apply)
+       source_dest_check         = false
+       subnet_id                 = (known after apply)
+       tags                      = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                  = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }

+       attachment (known after apply)
    }

  # module.network.module.nat.aws_route.this[0] will be created
+ resource "aws_route" "this" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # module.network.module.nat.aws_route.this[1] will be created
+ resource "aws_route" "this" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # module.network.module.nat.aws_route.this[2] will be created
+ resource "aws_route" "this" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # module.network.module.nat.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "Security group for NAT instance my-2-tier-ec2"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "my-2-tier-ec2"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all               = {
+           "Name"        = "nat-instance-my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                 = (known after apply)
    }

  # module.network.module.nat.aws_security_group_rule.egress will be created
+ resource "aws_security_group_rule" "egress" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       from_port                = 0
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "egress"
    }

  # module.network.module.nat.aws_security_group_rule.ingress_any will be created
+ resource "aws_security_group_rule" "ingress_any" {
+       cidr_blocks              = [
+           "10.0.0.0/24",
+           "10.0.1.0/24",
+           "10.0.2.0/24",
        ]
+       from_port                = 0
+       id                       = (known after apply)
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "ingress"
    }

  # module.network.module.vpc.aws_db_subnet_group.database[0] will be created
+ resource "aws_db_subnet_group" "database" {
+       arn                     = (known after apply)
+       description             = "Database subnet group for my-2-tier-ec2"
+       id                      = (known after apply)
+       name                    = "my-2-tier-ec2"
+       name_prefix             = (known after apply)
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Name"        = "my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                = {
+           "Name"        = "my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                  = (known after apply)
    }

  # module.network.module.vpc.aws_internet_gateway.this[0] will be created
+ resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name"        = "my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all = {
+           "Name"        = "my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id   = (known after apply)
    }

  # module.network.module.vpc.aws_route.public_internet_gateway[0] will be created
+ resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.network.module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all         = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.private[1] will be created
+ resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all         = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.private[2] will be created
+ resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all         = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table.public[0] will be created
+ resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "my-2-tier-ec2-public"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all         = {
+           "Name"        = "my-2-tier-ec2-public"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id           = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.database[0] will be created
+ resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.database[1] will be created
+ resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.database[2] will be created
+ resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.private[2] will be created
+ resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_route_table_association.public[2] will be created
+ resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.database[0] will be created
+ resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.9.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-db-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-db-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.database[1] will be created
+ resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.10.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-db-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-db-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.database[2] will be created
+ resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.11.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-db-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-db-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.private[2] will be created
+ resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-private-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.6.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-public-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-public-ap-northeast-2a"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.7.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-public-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-public-ap-northeast-2b"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_subnet.public[2] will be created
+ resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-northeast-2c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.8.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "my-2-tier-ec2-public-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                                       = {
+           "Name"        = "my-2-tier-ec2-public-ap-northeast-2c"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.network.module.vpc.aws_vpc.this[0] will be created
+ resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name"        = "my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                             = {
+           "Name"        = "my-2-tier-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
    }

  # module.server.module.ec2.data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           sid     = "EC2AssumeRole"

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "Service"
            }
        }
    }

  # module.server.module.ec2.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.server.module.ec2.aws_iam_instance_profile.this[0] will be created
+ resource "aws_iam_instance_profile" "this" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "single-instance-"
+       path        = "/"
+       role        = (known after apply)
+       tags        = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all    = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       unique_id   = (known after apply)
    }

  # module.server.module.ec2.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       description           = "IAM role for EC2 instance"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "single-instance-"
+       path                  = "/"
+       tags                  = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all              = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.server.module.ec2.aws_iam_role_policy_attachment.this["AmazonSSMManagedInstanceCore"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = (known after apply)
    }

  # module.server.module.ec2.aws_spot_instance_request.this[0] will be created
+ resource "aws_spot_instance_request" "this" {
+       ami                                  = "ami-0fa42ed59eb46290d"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_interruption_behavior       = "terminate"
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = true
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_bid_status                      = (known after apply)
+       spot_instance_id                     = (known after apply)
+       spot_price                           = (known after apply)
+       spot_request_state                   = (known after apply)
+       spot_type                            = "persistent"
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name"        = "single-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                             = {
+           "Name"        = "single-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tenancy                              = (known after apply)
+       user_data                            = "9ed2c9dc538139acb5cc39252ba530b47d49ac02"
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       valid_from                           = (known after apply)
+       valid_until                          = (known after apply)
+       volume_tags                          = {
+           "Name" = "single-instance"
        }
+       vpc_security_group_ids               = (known after apply)
+       wait_for_fulfillment                 = false

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       credit_specification {}

+       ebs_block_device (known after apply)

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device (known after apply)

+       maintenance_options (known after apply)

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "optional"
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)

+       timeouts {}
    }

  # module.server.module.sg_ssm.aws_security_group.this_name_prefix[0] will be created
+ resource "aws_security_group" "this_name_prefix" {
+       arn                    = (known after apply)
+       description            = "Security Group for EC2 Instance SSM"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "my-2-tier-ec2-ssm-ec2-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "my-2-tier-ec2-ssm-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all               = {
+           "Name"        = "my-2-tier-ec2-ssm-ec2"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.server.module.sg_ssm.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
+ resource "aws_security_group_rule" "egress_with_cidr_blocks" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress Rule"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.server.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ec2messages"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc_endpoint_service" "this" {
+       acceptance_required           = (known after apply)
+       arn                           = (known after apply)
+       availability_zones            = (known after apply)
+       base_endpoint_dns_names       = (known after apply)
+       id                            = (known after apply)
+       manages_vpc_endpoints         = (known after apply)
+       owner                         = (known after apply)
+       private_dns_name              = (known after apply)
+       private_dns_names             = (known after apply)
+       region                        = (known after apply)
+       service                       = "ec2messages"
+       service_id                    = (known after apply)
+       service_name                  = (known after apply)
+       service_type                  = (known after apply)
+       supported_ip_address_types    = (known after apply)
+       tags                          = (known after apply)
+       vpc_endpoint_policy_supported = (known after apply)

+       filter {
+           name   = "service-type"
+           values = [
+               "Interface",
            ]
        }
    }

  # module.server.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssm"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc_endpoint_service" "this" {
+       acceptance_required           = (known after apply)
+       arn                           = (known after apply)
+       availability_zones            = (known after apply)
+       base_endpoint_dns_names       = (known after apply)
+       id                            = (known after apply)
+       manages_vpc_endpoints         = (known after apply)
+       owner                         = (known after apply)
+       private_dns_name              = (known after apply)
+       private_dns_names             = (known after apply)
+       region                        = (known after apply)
+       service                       = "ssm"
+       service_id                    = (known after apply)
+       service_name                  = (known after apply)
+       service_type                  = (known after apply)
+       supported_ip_address_types    = (known after apply)
+       tags                          = (known after apply)
+       vpc_endpoint_policy_supported = (known after apply)

+       filter {
+           name   = "service-type"
+           values = [
+               "Interface",
            ]
        }
    }

  # module.server.module.vpc_endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc_endpoint_service" "this" {
+       acceptance_required           = (known after apply)
+       arn                           = (known after apply)
+       availability_zones            = (known after apply)
+       base_endpoint_dns_names       = (known after apply)
+       id                            = (known after apply)
+       manages_vpc_endpoints         = (known after apply)
+       owner                         = (known after apply)
+       private_dns_name              = (known after apply)
+       private_dns_names             = (known after apply)
+       region                        = (known after apply)
+       service                       = "ssmmessages"
+       service_id                    = (known after apply)
+       service_name                  = (known after apply)
+       service_type                  = (known after apply)
+       supported_ip_address_types    = (known after apply)
+       tags                          = (known after apply)
+       vpc_endpoint_policy_supported = (known after apply)

+       filter {
+           name   = "service-type"
+           values = [
+               "Interface",
            ]
        }
    }

  # module.server.module.vpc_endpoints.aws_security_group.this[0] will be created
+ resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "VPC endpoint security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "my-2-tier-ec2-vpc-endpoints"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "my-2-tier-ec2-vpc-endpoints"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all               = {
+           "Name"        = "my-2-tier-ec2-vpc-endpoints"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                 = (known after apply)
    }

  # module.server.module.vpc_endpoints.aws_security_group_rule.this["ingress_https"] will be created
+ resource "aws_security_group_rule" "this" {
+       cidr_blocks              = [
+           "10.0.0.0/24",
+           "10.0.1.0/24",
+           "10.0.2.0/24",
        ]
+       description              = "HTTPS from subnets"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.server.module.vpc_endpoints.aws_vpc_endpoint.this["ec2messages"] will be created
+ resource "aws_vpc_endpoint" "this" {
+       arn                   = (known after apply)
+       cidr_blocks           = (known after apply)
+       dns_entry             = (known after apply)
+       id                    = (known after apply)
+       ip_address_type       = (known after apply)
+       network_interface_ids = (known after apply)
+       owner_id              = (known after apply)
+       policy                = (known after apply)
+       prefix_list_id        = (known after apply)
+       private_dns_enabled   = false
+       requester_managed     = (known after apply)
+       route_table_ids       = (known after apply)
+       security_group_ids    = (known after apply)
+       service_name          = (known after apply)
+       service_region        = (known after apply)
+       state                 = (known after apply)
+       subnet_ids            = (known after apply)
+       tags                  = {
+           "Name"        = "my-2-tier-ec2-ec2messages"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all              = {
+           "Name"        = "my-2-tier-ec2-ec2messages"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_endpoint_type     = "Interface"
+       vpc_id                = (known after apply)

+       dns_options (known after apply)

+       subnet_configuration (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "10m"
+           update = "10m"
        }
    }

  # module.server.module.vpc_endpoints.aws_vpc_endpoint.this["ssm"] will be created
+ resource "aws_vpc_endpoint" "this" {
+       arn                   = (known after apply)
+       cidr_blocks           = (known after apply)
+       dns_entry             = (known after apply)
+       id                    = (known after apply)
+       ip_address_type       = (known after apply)
+       network_interface_ids = (known after apply)
+       owner_id              = (known after apply)
+       policy                = (known after apply)
+       prefix_list_id        = (known after apply)
+       private_dns_enabled   = false
+       requester_managed     = (known after apply)
+       route_table_ids       = (known after apply)
+       security_group_ids    = (known after apply)
+       service_name          = (known after apply)
+       service_region        = (known after apply)
+       state                 = (known after apply)
+       subnet_ids            = (known after apply)
+       tags                  = {
+           "Name"        = "my-2-tier-ec2-ssm"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all              = {
+           "Name"        = "my-2-tier-ec2-ssm"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_endpoint_type     = "Interface"
+       vpc_id                = (known after apply)

+       dns_options (known after apply)

+       subnet_configuration (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "10m"
+           update = "10m"
        }
    }

  # module.server.module.vpc_endpoints.aws_vpc_endpoint.this["ssmmessages"] will be created
+ resource "aws_vpc_endpoint" "this" {
+       arn                   = (known after apply)
+       cidr_blocks           = (known after apply)
+       dns_entry             = (known after apply)
+       id                    = (known after apply)
+       ip_address_type       = (known after apply)
+       network_interface_ids = (known after apply)
+       owner_id              = (known after apply)
+       policy                = (known after apply)
+       prefix_list_id        = (known after apply)
+       private_dns_enabled   = false
+       requester_managed     = (known after apply)
+       route_table_ids       = (known after apply)
+       security_group_ids    = (known after apply)
+       service_name          = (known after apply)
+       service_region        = (known after apply)
+       state                 = (known after apply)
+       subnet_ids            = (known after apply)
+       tags                  = {
+           "Name"        = "my-2-tier-ec2-ssmmessages"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all              = {
+           "Name"        = "my-2-tier-ec2-ssmmessages"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_endpoint_type     = "Interface"
+       vpc_id                = (known after apply)

+       dns_options (known after apply)

+       subnet_configuration (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "10m"
+           update = "10m"
        }
    }

  # module.db.module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "enhanced_monitoring" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]

+           principals {
+               identifiers = [
+                   "monitoring.rds.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.db.module.db.module.db_instance.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.db.module.db.module.db_instance.aws_db_instance.this[0] will be created
+ resource "aws_db_instance" "this" {
+       address                               = (known after apply)
+       allocated_storage                     = 20
+       allow_major_version_upgrade           = false
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = "03:00-06:00"
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = (known after apply)
+       db_subnet_group_name                  = (known after apply)
+       dedicated_log_volume                  = false
+       delete_automated_backups              = true
+       deletion_protection                   = false
+       domain_fqdn                           = (known after apply)
+       enabled_cloudwatch_logs_exports       = [
+           "general",
        ]
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_lifecycle_support              = (known after apply)
+       engine_version                        = "8.0"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       iam_database_authentication_enabled   = false
+       id                                    = (known after apply)
+       identifier                            = "rds-instance"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t4g.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = "mon:00:00-mon:03:00"
+       manage_master_user_password           = true
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       max_allocated_storage                 = 100
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = false
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = 3306
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_encrypted                     = true
+       storage_throughput                    = (known after apply)
+       storage_type                          = (known after apply)
+       tags                                  = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                              = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       timezone                              = (known after apply)
+       username                              = "dev"
+       vpc_security_group_ids                = (known after apply)

+       timeouts {}
    }

  # module.db.module.db.module.db_option_group.aws_db_option_group.this[0] will be created
+ resource "aws_db_option_group" "this" {
+       arn                      = (known after apply)
+       engine_name              = "mysql"
+       id                       = (known after apply)
+       major_engine_version     = "8.0"
+       name                     = (known after apply)
+       name_prefix              = "rds-instance-"
+       option_group_description = "rds-instance option group"
+       skip_destroy             = false
+       tags                     = {
+           "Name"        = "rds-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all                 = {
+           "Name"        = "rds-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }

+       timeouts {}
    }

  # module.db.module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
+ resource "aws_db_parameter_group" "this" {
+       arn          = (known after apply)
+       description  = "rds-instance parameter group"
+       family       = "mysql8.0"
+       id           = (known after apply)
+       name         = (known after apply)
+       name_prefix  = "rds-instance-"
+       skip_destroy = false
+       tags         = {
+           "Name"        = "rds-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all     = {
+           "Name"        = "rds-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }

+       parameter {
+           apply_method = "immediate"
+           name         = "character_set_client"
+           value        = "utf8mb4"
        }
+       parameter {
+           apply_method = "immediate"
+           name         = "character_set_server"
+           value        = "utf8mb4"
        }
    }

Plan: 56 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p 02.2-tiers-ec2
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.layground.store/lock?id=cheonkyu%252Fterraform-provisioning%252Fterraform%252Fscenario%252F02.2-tiers-ec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p 02.2-tiers-ec2
  ```
Plan: 56 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```